
&НаКлиенте
Процедура ПреобразоватьJSON(Команда) 
	
    Итог = Лев(Объект.ТекстСообщения, СтрДлина(Объект.ТекстСообщения)-2); 
	ПоискВхождения = СтрНайти(Итог, "{", , , 2); 
	Итог = Сред(Итог, ПоискВхождения);
	Сообщить(Итог);
	
	ПараметрыСообщения = Сред(Объект.ТекстСообщения, 1, СтрНайти(Объект.ТекстСообщения, ",")-1);
	Сообщить(ПараметрыСообщения + Символы.ПС + "}");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпонитьРЗПолучение(Команда)
	ВыпонитьРЗПолучениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыпонитьРЗПолучениеНаСервере()
	
	RMQСервер.СоздатьЭлементСправочника();

КонецПроцедуры
